Documents/ЛБ_УстановитьЛомбардыВГруппу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_УстановитьЛомбардыВГруппу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЛБ_ГруппыЛомбардов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ломбарды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ломбард</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ГруппыЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ГруппыЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ГруппыЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛБ_УстановитьЛомбардыВГруппу/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Группа") Тогда   
		 Объект.Группа = Параметры.Группа;
	КонецЕсли;	
    УстановитьСостояниеДокумента();   
	ЗаполнитьСписокЛомбардов();
	ЛБ_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(, Объект, ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры  

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);

КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЛомбардов()
	Результат = "";
	Для каждого Стр Из Объект.Ломбарды Цикл
		Результат = Результат + ?(ПустаяСтрока(Результат), "", "; ") + СокрЛП(Стр.Ломбард);
	КонецЦикла;	
	СписокЛомбардов = Результат;
КонецПроцедуры	

// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 

// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 
&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) 
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды&НаСервере

&НаКлиенте
Процедура ВыбратьЛомбарды(Команда)
	ПараметрыФормы = Новый Структура;    
	ПараметрыФормы.Вставить("Ломбарды", Объект.Ломбарды);  
	ПараметрыФормы.Вставить("Вид", 1); 
	ПараметрыФормы.Вставить("ДатаДок", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата()));
	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораЛомбардов",ЭтаФорма);
	
	ОткрытьФорму("Обработка.ЛБ_ВыборЛомбардовИзСписка.Форма", ПараметрыФормы, СписокЛомбардов,,,, ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораЛомбардов(Результат, ДопПараметры) Экспорт
    Если Результат = Неопределено Тогда
        Возврат;
	КонецЕсли;

	Объект.Ломбарды.Очистить();
	КоличествоВыбрано = Результат.Количество;
	Для сч = 1 По КоличествоВыбрано Цикл
		НоваяСтр = Объект.Ломбарды.Добавить();
		НоваяСтр.Ломбард = Результат["Значение" + Строка(сч)];
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛомбардыНаСервере()  
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Дата, ТекущаяДата())); 
	Запрос.УстановитьПараметр("Группа", Объект.Группа);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ГруппыЛомбардовСрезПоследних.Ломбард КАК Ломбард
	               |ИЗ
	               |	РегистрСведений.ЛБ_ГруппыЛомбардов.СрезПоследних(&Дата, Группа = &Группа) КАК ЛБ_ГруппыЛомбардовСрезПоследних";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Объект.Ломбарды.Загрузить(ТаблицаЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура ОтделениеПриИзменении(Элемент)
	ЗаполнитьЛомбардыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Отделение) Тогда  
		Сообщить("Не выбрано отделение!");
		Возврат;
	КонецЕсли;	   
	
	ЗаполнитьЛомбардыНаСервере();
КонецПроцедуры
